function номерЛотереи() {
  return Math.floor(Math.random() * 99);
}
function выиграшныеНомераЛотереи() {
  let номер1 = номерЛотереи();
  let номер2 = номерЛотереи();
  let номер3 = номерЛотереи();
  alert("Выиграшные номера городской лотереи " + номер1 + " - " + номер2 + " - " + номер3 + ".\nЕсли номера вашей лотереи совпадают с теми, что вы видите на экране, поздравляем!!! Вы - победитель городской лотереи!");
}
выиграшныеНомераЛотереи();
_________________________________________

function номерЛотереи() {
  return Math.floor(Math.random() * 99);
}
function выиграшныеНомераЛотереи() {
  let номер1 = номерЛотереи();
  let номер2 = номерЛотереи();
  let номер3 = номерЛотереи();
  console.log(
    "Выиграшные номера городской лотереи " +
      номер1 +
      " - " +
      номер2 +
      " - " +
      номер3 +
      ".\nПоздравляем!!! Вы - победитель городской лотереи!"
  );
}
выиграшныеНомераЛотереи();
_________________________________________
function номерЛотереи() {
  return Math.floor(Math.random() * 10);
}
function выиграшныеНомераЛотереи() {
  let номер1 = номерЛотереи();
  let номер2 = номерЛотереи();
  let номер3 = номерЛотереи();
  console.log(
    "Выиграшные номера городской лотереи " +
      номер1 +
      " - " +
      номер2 +
      " - " +
      номер3 +
      ".\nПоздравляем!!! Вы - победитель городской лотереи!"
  );
}
выиграшныеНомераЛотереи();
_________________________________________

function номерЛотереи() {
  return Math.floor(Math.random() * 10);
}
function выиграшныеНомераЛотереи() {
  let номер1 = номерЛотереи();
  let номер2 = номерЛотереи();
  let номер3 = номерЛотереи();
  alert(
    "Выиграшные номера городской лотереи " +
      номер1 +
      " - " +
      номер2 +
      " - " +
      номер3 +
      ".\nЕсли номера вашей лотереи совпадают с теми, что вы видите на экране, поздравляем!!! Вы - победитель городской лотереи!"
  );
}
выиграшныеНомераЛотереи();