3 % 3;
4 % 3;
5 % 3;
6 % 3;
7 % 3;
8 % 3;
9 % 3;
10 % 3;
11 % 3;
12 % 3;
13 % 3;
14 % 3;
15 % 3;
16 % 3;
17 % 3;
18 % 3;

//0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1, 2, 0;

8 % 2;
//0

9 % 2;
//1

//Игра "Вышибала"

let количествоКоманд = 3;
let номерId = 1;
номерId % количествоКоманд;
номерId = 2;
номерId % количествоКоманд;
номерId = 3;
номерId % количествоКоманд;
номерId = 4;
номерId % количествоКоманд;
номерId = 5;
номерId % количествоКоманд;
номерId = 6;
номерId % количествоКоманд;
номерId = 7;
номерId % количествоКоманд;
номерId = 8;
номерId % количествоКоманд;
номерId = 9;
номерId % количествоКоманд;
номерId = 10;
номерId % количествоКоманд;
номерId = 11;
номерId % количествоКоманд;
номерId = 12;
номерId % количествоКоманд;
