//Игра "Квадрат"

let количествоКоманд = 4;
let номерId = 1;
let номерКвадрата = номерId % количествоКоманд;
номерКвадрата;
//1

номерId = 2;
номерКвадрата = номерId % количествоКоманд;
номерКвадрата;
//2

номерId = 3;
номерКвадрата = номерId % количествоКоманд;
номерКвадрата;
//3

номерId = 4;
номерКвадрата = номерId % количествоКоманд;
номерКвадрата;
//0

номерId = 5;
номерКвадрата = номерId % количествоКоманд;
номерКвадрата;
//1

номерId = 6;
номерКвадрата = номерId % количествоКоманд;
номерКвадрата;
//2

номерId = 7;
номерКвадрата = номерId % количествоКоманд;
номерКвадрата;
//3

номерId = 8;
номерКвадрата = номерId % количествоКоманд;
номерКвадрата;
//0

номерId = 9;
номерКвадрата = номерId % количествоКоманд;
номерКвадрата;
//1

номерId = 10;
номерКвадрата = номерId % количествоКоманд;
номерКвадрата;
//2

номерId = 11;
номерКвадрата = номерId % количествоКоманд;
номерКвадрата;
//3

номерId = 12;
номерКвадрата = номерId % количествоКоманд;
номерКвадрата;
//0

номерId = 13;
номерКвадрата = номерId % количествоКоманд;
номерКвадрата;
//1

номерId = 14;
номерКвадрата = номерId % количествоКоманд;
номерКвадрата;
//2

номерId = 15;
номерКвадрата = номерId % количествоКоманд;
номерКвадрата;
//3

номерId = 16;
номерКвадрата = номерId % количествоКоманд;
номерКвадрата;
//0

//Второй вариант

let номерКвадрата = 4;
let номерId = 1;
номерId % номерКвадрата;
номерId = 2;
номерId % номерКвадрата;
номерId = 3;
номерId % номерКвадрата;
номерId = 4;
номерId % номерКвадрата;
номерId = 5;
номерId % номерКвадрата;
номерId = 6;
номерId % номерКвадрата;
номерId = 7;
номерId % номерКвадрата;
номерId = 8;
номерId % номерКвадрата;
номерId = 9;
номерId % номерКвадрата;
номерId = 10;
номерId % номерКвадрата;
номерId = 11;
номерId % номерКвадрата;
номерId = 12;
номерId % номерКвадрата;
