let любимаяДобавка = "пепперони";
let втораяЛюбимаяДобавка = "сосиски";
let шикарнаяПицца = любимаяДобавка + " и " + втораяЛюбимаяДобавка;
шикарнаяПицца;
"пепперони и сосиски";

var всего = 6 + 7 + 8;
всего;
21;

var возрастБрата = 11;
var возрастСестры = 13;
var количествоБратьевИлиСестер = 2;
var среднийВозраст = (возрастБрата + возрастСестры) / количествоБратьевИлиСестер;
среднийВозраст;
4;

let крутоеЧисло = 5;
let крутойОтвет = (20 / крутоеЧисло) + ((8 * крутоеЧисло) / (6 - 2));
крутойОтвет;
14;

6 + " футов " + 7 + " футов";
"6 футов 7 футов";

"Работаю с " + 9 + " до " + 5;
"Работаю с 9 до 5";

7 + "3";
"73";

12 / 0;
Infinity;