let сумма = 5 + 3;
сумма = сумма + 3;
сумма;

let значение = 5;
значение += 2;
значение;
//7

значение += 3;
значение;
//10

значение = значение + значение;
значение;
//20

значение += значение;
значение;
//40

значение -= 25;
значение;
//15

значение *= 2;
значение;
//30

значение /= 3;
значение;
//10

let ответ = 0;
ответ += 2;
ответ *= 30;
ответ -= 12;
ответ /= 6;
ответ *= 7 - 5;
ответ += ответ;
ответ /= 4;
ответ -= ответ;
ответ;
//0

// Инкремент
let счетчик = 0;
счетчик++;
счетчик++;
счетчик;
//2

// Декремент
let счетчик = 3;
счетчик--;
счетчик;
//2

// Три способа
let счетчик = 0;
счетчик = счетчик + 1;
счетчик += 1;
счетчик++;
счетчик;
//3

// Три способа
let счетчик = 3;
счетчик = счетчик - 1;
счетчик -= 1;
счетчик--;
счетчик;
//0
