8 * (7 - 5);
15 / (6 - 4 + 1);
(7 + (3 * 1) - 2) / (3 - 1);
((5 + 3) / (10 - 6)) * 3;

let сумма = 6;
сумма *= 5;
сумма -= 10;
сумма /= 4;
сумма += сумма * 3;
сумма;
//20

let сколькоМонетВКармане = 5;
сколькоМонетВКармане++;
сколькоМонетВКармане++;
сколькоМонетВКармане--;
сколькоМонетВКармане++;
сколькоМонетВКармане;
//7

14 % 3;
//2

(20 - 10) % (8 - 4);
//2

4 * (500 % 5);
//0

2018 % 100;
//18

15 % (3 + 1);
//3

let количествоКоманд = 4;
let всегоУчеников = 17;
let номерКоманды = всегоУчеников % количествоКоманд;
номерКоманды;
//1